In [11]:
import pandas as pd

In [13]:
data={"EmployeeID":[201,202,203,204,205,206,207,208,209],
      "Name":["Diaya","Dhanu","Delli","Keerthi","Bhumika","Amar","Sathvik","Rajakumar","Priya"],
      "Department":["Finance and Accounting","Human Resources","Marketing","Sales","Customer Service","Information Technology","Research and Development","Legal","Procurement"],
      "Salary":[46000,26600,43000,26800,27000,25800,42000,40000,42200]
     }
data

{'EmployeeID': [201, 202, 203, 204, 205, 206, 207, 208, 209],
 'Name': ['Diaya',
  'Dhanu',
  'Delli',
  'Keerthi',
  'Bhumika',
  'Amar',
  'Sathvik',
  'Rajakumar',
  'Priya'],
 'Department': ['Finance and Accounting',
  'Human Resources',
  'Marketing',
  'Sales',
  'Customer Service',
  'Information Technology',
  'Research and Development',
  'Legal',
  'Procurement'],
 'Salary': [46000, 26600, 43000, 26800, 27000, 25800, 42000, 40000, 42200]}

In [15]:
df=pd.DataFrame(data)
df

   EmployeeID       Name                Department  Salary
0         201      Diaya    Finance and Accounting   46000
1         202      Dhanu           Human Resources   26600
2         203      Delli                 Marketing   43000
3         204    Keerthi                     Sales   26800
4         205    Bhumika          Customer Service   27000
5         206       Amar    Information Technology   25800
6         207    Sathvik  Research and Development   42000
7         208  Rajakumar                     Legal   40000
8         209      Priya               Procurement   42200

In [17]:
df.head(5)

   EmployeeID     Name              Department  Salary
0         201    Diaya  Finance and Accounting   46000
1         202    Dhanu         Human Resources   26600
2         203    Delli               Marketing   43000
3         204  Keerthi                   Sales   26800
4         205  Bhumika        Customer Service   27000

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  9 non-null      int64
 1   Name        9 non-null      object
 2   Department  9 non-null      object
 3   Salary      9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 420.0+ bytes

In [21]:
df.describe()

       EmployeeID        Salary
count    9.000000      9.000000
mean   205.000000  35488.888889
std      2.738613   8625.028180
min    201.000000  25800.000000
25%    203.000000  26800.000000
50%    205.000000  40000.000000
75%    207.000000  42200.000000
max    209.000000  46000.000000

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\prakr_rewvga6\OneDrive\Employee.csv")
df

   EmployeeID     Name  Age  Department  Salary
0           1    Alice   25          HR    3500
1           2      Bob   25     Finance    3600
2           3  Charlie   27  Markerting    3700
3           4      Eva   28       Sales    3800
4           5    Fiona   29          IT    3900

In [5]:
df.isnull()

   EmployeeID   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False  False       False   False
4       False  False  False       False   False

In [7]:
df.isnull().sum()

EmployeeID    0
Name          0
Age           0
Department    0
Salary        0
dtype: int64

In [9]:
df["Name"].unique()

array(['Alice', 'Bob', 'Charlie', 'Eva', 'Fiona'], dtype=object)

In [11]:
df["Department"].unique()

array(['HR', 'Finance', 'Markerting', 'Sales', 'IT'], dtype=object)

In [13]:
df["Salary"].unique()

array([3500, 3600, 3700, 3800, 3900], dtype=int64)

In [15]:
df["Age"].unique()

array([25, 27, 28, 29], dtype=int64)

In [17]:
df["EmployeeID"].unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [19]:
df.to_csv("Employee.csv",index=True)

In [21]:
Employee=pd.DataFrame(df)

In [23]:
Employee

   EmployeeID     Name  Age  Department  Salary
0           1    Alice   25          HR    3500
1           2      Bob   25     Finance    3600
2           3  Charlie   27  Markerting    3700
3           4      Eva   28       Sales    3800
4           5    Fiona   29          IT    3900